"""
Задайте список случайных чисел. Выведите:
а) список чисел, которые не повторяются в заданном списке,
б) список повторяемых чисел,
в) список без повторений
Ввод: значение типа <list>
Вывод: три объекта типа <list>
Пример:
[1, 2, 3, 5, 1, 5, 3, 10]
[2, 10]
[1, 3, 5]
[1, 2, 5, 3, 10]
"""
lst = [1, 2, 3, 5, 1, 5, 3, 10]

from collections import Counter

c = Counter(lst)

b = [n for n in c if c[n] == 1]
print(b)

d = [x for x in c.keys() if c[x] > 1]
print(d)


# с повторами:

f = [x for x in lst if c[x] > 1]
print(f)
